{"248657":"NFTs","8011093":"Join community","58456987":"Business inquiry","-204ff822":"Sign Up","8e8":"GO","7bfe5b15":"Enjoy ","-383267c2":"real life","-147084cb":"brand benefits","2b3dee73":"with your ","18cc9":"for","-4b5ba1bc":" NFT Users","-343f823f":"Unlock the real value of your NFTs","-670f4c8a":"Easy-to-use NFT IRL utility discovery. Your NFT is more valuable than you think!","-1555fd95":"Manage your perks at a one-stop platform","6d90a71e":"A hassle-free platform for NFT users to redeem and manage rewards. No grinding anymore!","418c2ab4":"Enjoy community-driven shopping and entertaining experience","-46b02c34":"Enjoy a new way to shop. Feel inclusive and empowered! ","7ea3f3ba":"For the latest news ","-58bc8822":"SIGN UP","13db7a0c":" Brands","-7e5bcd10":"Connect with next-generation consumers leveraging NFTs","-34bdf73f":"Brands can now instantly reach and connect with NFT native users by creating campaignsusing the Mintology platform tools.","2d42c7":"Activate brand NFT strategy seamlessly","e5d72b1":"Brands can launch their own NFTs/ exclusive deals to further engage with their target audience.","-73b6203e":"Accelate business through data-driven insights and CRM integration","5c90a4d5":"Merchant dashboard and platform data to unlock more business opportunities and efficiency. ","7e090c69":"Web2 brands are lacking of tool and  platform to create meaningful campaigns and engage with web3 users in a scalable way. Web3 NFT users are lacking of IRL (in-real-life) utilities for their NFT assets.Mintology is here to resolve these problems. .","-2a70ac74":"Cindy Jin","53436b6e":"Co-founder","-60d56e5c":"We are looking for brands and businesses to join this exciting journey. Give us a shout if you are interested!","24eeab":"Name","-2b7010d0":"Email Address","-36c081fd":"Tell us more about your brand/business. (optional) ","6802628d":"Thank you for submission! The team will be in touch soon","-7c112e99":"Oops! Something went wrong while submitting the form.","105e9c4":"Bridging Brands with NFT Users","7d093d09":"© 2022 Mintology. All Rights Reserved","-3afac8b9":"Quicklink","36ab1513":"Request a demo","7f2746de":"Contact Us","-5ae80293":"Follow Us","-30a251c7":"Sign up to receive emails on launching news, events and more.","1ea8255":"You're on the list! 🎉","3245f728":"Keep an eye on your inbox for updates."}