{
  "3f3bf44": "Drops",
  "-64104400": "Contact",
  "53ec0514": "Request Demo",
  "8e8": "GO",
  "4cd7204b": "The NFT Platform that Bridges",
  "771411ec": "Brands",
  "1ec1506": " With",
  "12d9c": "NFT",
  "4e39de8": "Users",
  "18cc9": "for",
  "13db7a0c": " Brands",
  "-7de18a9d": "Connect with next generation consumers leveraging NFTs",
  "-78afc9bc": "Brands can now reach and connect with the NFT nattive users instantly by creating campaigns using the Mintology platform tools.",
  "2d42c7": "Activate brand NFT strategy seamlessly",
  "e5d72b1": "Brands can launch their own NFTs/ exclusive deals to further engage with their target audience.",
  "-67d489e": "Accelerate business through data driven insights and CRM integration",
  "-3a6958fa": "Merchant dashboard and more platform data to unlock more business opportunities and efficiency. ",
  "-4b5ba1bc": " NFT Users",
  "-343f823f": "Unlock the real value of your NFTs",
  "-670f4c8a": "Easy-to-use NFT IRL utility discovery. Your NFT is more valuable than you think!",
  "67a8f891": "Manage my perks at one-stop platform",
  "3041602e": "Hassle-free platform for NFT users to redeem and manage the rewards. No grinding anymore!",
  "5b8ad0e1": "Enjoy community driven shopping and entertaining experience",
  "-46b02c34": "Enjoy a new way to shop. Feel inclusive and empowered! ",
  "7e090c69": "Web2 brands are lacking of tool and  platform to create meaningful campaigns and engage with web3 users in a scalable way. Web3 NFT users are lacking of IRL (in-real-life) utilities for their NFT assets.Mintology is here to resolve these problems. .",
  "-2a70ac74": "Cindy Jin",
  "53436b6e": "Co-founder",
  "1cec7cb5": "Early Signup",
  "149f92ae": "We are looking for NFT communities and brands to join the exciting journey with us. Give us a shout if you are interested!",
  "24eeab": "Name",
  "-2b7010d0": "Email Address",
  "1105c64e": "Tell us more about your project/ brand. (optional) ",
  "6802628d": "Thank you for submission! The team will be in touch soon",
  "-7c112e99": "Oops! Something went wrong while submitting the form.",
  "105e9c4": "Bridging Brands with NFT Users",
  "-b2702d6": "© 2021 Mintology. All Rights Reserved",
  "-3afac8b9": "Quicklink",
  "36ab1513": "Request a demo",
  "7f2746de": "Contact Us",
  "-5ae80293": "Follow Us"
}